export default async function before(m, { conn , bot }) {
  const triggers = {
    "السلام عليكم": ["*وعليكم السلام منور يغالي 🤎*", "*وعليكم السلام ورحمة الله وبركاته ❤️*"],
    "تست": ["عايز تقلش؟", "تست تست"],
    "هلا": ["*هلا وغلا*", "*هلا بيك*", "*يا هلا*"],
    "باي": ["*مع السلامة*", "*باي باي*", "*الله معاك*"],
    "صباح الخير": ["*صباح النور*", "*صباح الورد*", "*صباح الفل*"],
    "مساء الخير": ["*مساء النور*", "*مساء الورد*", "*مساء الفل*", "*مساء الجوري*"],
    "مساء النور": ["*مساء الورد*", "*مساء الفل*", "*الله نورك*"]
"ميتسوري بتسلم عليك ": ["*ميتسوووو الله يسلمها*", "*ميتسوووو الله يسلمها*", "*ميتسوووو الله يسلمها*"]
      "اريما بيكلمك ": ["*انا اسف والله مكنتش اعرف*", "*سامحني يا امبروير بالله عليك *", "*خادمك المطيع 𝒁𝑬𝑰𝑹𝑨𝑴*"]
   "ناغومو بيسلم عليك ": ["*الملك بنفسه بيسلم عليا؟*", "*كداب مش مصدقك *", "*تحيه للقائد*"]
    "مازن بيسلم عليك": ["*الله يسلمك يا اخويا يا دحيح *", "*هتعلي التنسيق امتي*", "*هو مش بيذاكر ليه *"]
 "لوسيفر بيسلم عليك ": ["*كلزق *", "* رفضتني في المنظمه ليه*", "*ايوه مين يعني *"]
[/
  const replies = triggers[m.body];
  if (replies) {
    const ranReply = replies[Math.floor(Math.random() * replies.length)];
    m.reply(ranReply);
  }
  
  return false;

