export default async function before(m, { conn }) {

  const text = (m.body || m.text || "").trim();

  const triggers = {
    "السلام عليكم": ["وعليكم السلام 🤎", "وعليكم السلام ورحمة الله ❤️"],
    "تست": ["عايز تقلش؟", "تست تست"],
    "هلا": ["هلا وغلا", "هلا بيك", "يا هلا"],
    "باي": ["مع السلامة", "باي باي", "الله معاك"],
    "صباح الخير": ["صباح النور", "صباح الورد", "صباح الفل"],
    "مساء الخير": ["مساء النور", "مساء الورد", "مساء الفل"],

    "ميتسوري بتسلم عليك": ["ميتسوووو الله يسلمها"],
    "اريما بيكلمك": ["انا اسف", "سامحني", "خادمك المطيع"],
    "ناغومو بيسلم عليك": ["تحيه للقائد"],
    "مازن بيكلمك": ["الله يسلمك يا دحيح"],
    "لوسيفر بيسلم عليك": ["مين يعني؟"]
  };

  const replies = triggers[text];

  if (replies) {
    const reply = replies[Math.floor(Math.random() * replies.length)];
    await m.reply(reply);
  }
}
